<?php
//---------------------------
//Отримати залишок від ділення 7 на 3
//
//$war = 7;
//$war1 = 3;
//$ress = $war % war1;
//echo ress;
//-----------------------------//
//----------------------------------
//Отримати цілу частину ділення 7 и 7,15
//echo (int) (7/3), "\n";
//echo (int) (7.15/3), "\n";

//----------------------------------
//$waar = 7;
//$waar1 = 3;
//echo (int) ($waar / $waar1 ), "\n";
//
//$waar = 7.15;
//$waar1 = 3;
//echo (int) ($waar / $waar1 ), "\n";
//----------------------------------

//------------------------------------
//Отримати корінь из 25
//echo sqrt(25);
//------------------------------------

//------------------------------------
//Отримати 4-е слово з фрази - Десять негритят пошли купаться в море
//$string = substr("Десять негритят пошли купаться в море", 41, -11);
//
//echo $string;
//------------------------------------

//--------------------------------------
//Отримати 17-й символ із фрази - Десять негритят пошли купаться в море
//
//$string = "Десять негритят пошли купаться в море";
//$string1 = mb_substr($string, 16, 1);
//echo "17й символ: " . $string1;
//--------------------------------------

//--------------------------------------
//Зробити великою кожну першу букву слів фрази - Десять негритят пошли купаться в море
//$str = ("Десять негритят пошли купаться в море");
//$str = mb_convert_case($str, MB_CASE_TITLE);
//echo $str;
//--------------------------------------

//--------------------------------------
//Порахувати длину строки - Десять негритят пошли купаться в море
//
//$string = "Десять негритят пошли купаться в море";
//$string1 = mb_strlen($string);
//echo "$string1", "\n";
//--------------------------------------

//Яка строка більше three - три
//$three = "three";
//$tri = "три";
//$three1 = strlen($three);
//$tri1 = mb_strlen($tri);
//if ($three1 > $tri1){
//    echo "$three больше чем $tri";
//}
//elseif ($three1 < $tri1){
//    echo "$three меньше чем $tri";
//} else {
//    echo "имеют одинаковую длину";
//}

//Яке число більше 125 умножить на 13 плюс 7 или 223 плюс 28 умножить 2
//
//$a_125 = 125;
//$a_13 = 13;
//$a_7 = 7;
//
//$result = $a_125* $a_13+ $a_7; //1632
//Echo $result, "\n";
//
//$b_223 = 223;
//$b_28 = 28;
//$b_2 = 2;
//
//$result2 = $b_223+ $b_28*$b_2; //279
//echo $result2, "\n";
//
//if ($result > $result2) {
//    elseif echo "1632 больше чем 279","\n";
//    }
//elseif ($result < $result2) {
// echo "1632 меньше чем 279","\n";
//    }
//else ($result == $result2) {
//    echo "1632 одинаковые 279","\n";
//}

//Чи вірно твердження true дорівнює 1
//
//$bool = true;
//    if ($bool == 1) {
//        echo "True ровняется 1";
//    }
//    else {
//        echo "True не ровняется 1";
//}
//
//Чи вірно твердження false тождественно 0
//
//if (false === 0) {
//    echo "";
//}
//else {
//    echo "False не тождественно 0";
//}
//
